## MANNING PROJECTS - Demographic Data Analysis

In [1]:
import pandas as pd
import os
import re
import numpy as np
pd.set_option('display.float_format', '{:.2f}'.format)

## 1. Data Collection and Cleaning

In [2]:
folder_path = r'C:\Users\igord\Projects\Manning\Life_exp\csv'

In [3]:
separator = '\\'

In [4]:
file_list = os.listdir(folder_path)

In [5]:
file_list

['area.csv',
 'crime.csv',
 'education.csv',
 'income.xls',
 'income.xlsx',
 'life_expectancy.csv',
 'region.txt']

Custom service functions

In [6]:
def index_state(df):
    df.State = [x.strip() for x in df.State]
    df['State'] = df['State'].str.replace(' ','_')
    df.set_index('State', inplace = True)
    df.sort_index(inplace = True)

In [7]:
def replace_coma(df):
    for col in df.select_dtypes('object').columns:
        df[col] = df[col].str.replace(',','')

In [8]:
def numerize(df):
    for col in df.select_dtypes('object').columns:
        df[col] = pd.to_numeric(df[col])

### 1.1 Area file

In [9]:
area = pd.read_csv(folder_path + separator + file_list[0], delimiter = ';')

In [10]:
index_state(area)

In [11]:
area.shape

(50, 11)

In [12]:
area = area.drop_duplicates()

In [13]:
area.isnull().sum()

TotalRank    0
TotalSqMi    0
TotalKmQ     0
LandRank     0
LandSqMi     0
LandKmQ      0
LandPer      0
WaterRank    0
WaterSqMi    0
WaterKmQ     0
WaterPer     0
dtype: int64

In [14]:
area.dtypes

TotalRank      int64
TotalSqMi    float64
TotalKmQ       int64
LandRank       int64
LandSqMi     float64
LandKmQ        int64
LandPer      float64
WaterRank      int64
WaterSqMi    float64
WaterKmQ       int64
WaterPer     float64
dtype: object

In [15]:
area.head(2)

,TotalRank,TotalSqMi,TotalKmQ,LandRank,LandSqMi,LandKmQ,LandPer,WaterRank,WaterSqMi,WaterKmQ,WaterPer
State,,,,,,,,,,,
Alabama,30,52420.07,135767,28,50645.33,131171,96.61,23,1774.74,4597,3.39
Alaska,1,665384.04,1723337,1,570640.95,1477953,85.76,1,94743.10,245384,14.24

### 1.2 Crime file

In [16]:
crime = pd.read_csv(folder_path + separator + file_list[1], delimiter = ';')

In [17]:
# removing rows with junk data in states
crime.set_index('State', inplace = True)
states = [x for x in crime.index if len(x) >= 4]
crime = crime.loc[states]

In [18]:
crime = crime.iloc[:-1]

In [19]:
crime.columns

Index(['Population\n(total inhabitants) \n(2015) [2]',
       'Murders and\nNonnegligent\nManslaughter\n(total deaths) \n(2015) [1]',
       'Murders\n(total deaths) \n(2015) [3]',
       'Gun Murders\n(total deaths) \n(2015) [3]',
       'Gun\nOwnership\n(%) \n(2013) [4]',
       'Murder and\nNonnegligent\nManslaughter\nRate\n(per 100,000) \n(2015)',
       'Murder Rate\n(per 100,000) \n(2015)',
       'Gun\nMurder Rate\n(per 100,000) \n(2015)'],
      dtype='object')

In [20]:
crime.columns = ['Population_total', 'Murders_and_Manslaughter', 'Murders',
                 'Gun_Murders', 'Gun_Ownership', 'Murder_and_manslaughter_rate',
                'Murder_rate', 'Gun_Murder_rate']

In [21]:
replace_coma(crime)

In [22]:
crime.loc['Illinois','Population_total'] = crime.loc['Illinois','Population_total'].replace('[5]','')

In [23]:
for col in crime.select_dtypes('object').columns:
    crime[col][~crime[col].str.match('(\d+)')]  = np.nan

<ipython-input-23-b10c94921207>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  crime[col][~crime[col].str.match('(\d+)')]  = np.nan

In [24]:
crime.dtypes

Population_total                 object
Murders_and_Manslaughter         object
Murders                          object
Gun_Murders                      object
Gun_Ownership                   float64
Murder_and_manslaughter_rate    float64
Murder_rate                      object
Gun_Murder_rate                  object
dtype: object

In [25]:
numerize(crime)

In [26]:
crime.dtypes

Population_total                  int64
Murders_and_Manslaughter          int64
Murders                         float64
Gun_Murders                     float64
Gun_Ownership                   float64
Murder_and_manslaughter_rate    float64
Murder_rate                     float64
Gun_Murder_rate                 float64
dtype: object

In [27]:
crime.head(2)

,Population_total,Murders_and_Manslaughter,Murders,Gun_Murders,Gun_Ownership,Murder_and_manslaughter_rate,Murder_rate,Gun_Murder_rate
State,,,,,,,,
Alabama,4853875,348,NaN,NaN,48.90,7.20,NaN,NaN
Alaska,737709,59,57.00,39.00,61.70,8.00,7.70,5.30

### 1.3 Education file

In [28]:
edu = pd.read_csv(folder_path + separator + file_list[2], delimiter = ';', header = 1)

In [29]:
edu.columns = ['State', 'high_school', 'high_school_rank', 'ba_degree', 'ba_rank', 'adv_degree', 'adv_rank']

In [30]:
index_state(edu)

In [31]:
edu.drop(index = 'United_States', inplace = True)

In [32]:
edu.dtypes

high_school          object
high_school_rank    float64
ba_degree            object
ba_rank             float64
adv_degree           object
adv_rank            float64
dtype: object

In [33]:
for col in edu.select_dtypes('object').columns:
    edu[col] = edu[col].str.replace('%','')

In [34]:
numerize(edu)

In [35]:
edu.dtypes

high_school         float64
high_school_rank    float64
ba_degree           float64
ba_rank             float64
adv_degree          float64
adv_rank            float64
dtype: object

In [36]:
edu.head(2)

,high_school,high_school_rank,ba_degree,ba_rank,adv_degree,adv_rank
State,,,,,,
Alabama,85.30,44.00,24.50,45.00,9.10,41.00
Alaska,92.40,5.00,29.00,28.00,10.40,29.00

### 1.4 Income xlsx file

In [37]:
income = pd.read_excel(folder_path + separator + file_list[4], header = 1)

In [38]:
income.drop(columns = 'Rank', inplace = True)

In [39]:
index_state(income)

In [40]:
income.dtypes

Income2017    int64
Income2016    int64
Income2015    int64
Income2014    int64
Income2013    int64
Income2012    int64
Income2011    int64
Income2010    int64
Income2009    int64
Income2008    int64
Income2007    int64
dtype: object

In [41]:
income.head(2)

,Income2017,Income2016,Income2015,Income2014,Income2013,Income2012,Income2011,Income2010,Income2009,Income2008,Income2007
State,,,,,,,,,,,
Alabama,48123,46257,44765,42830,42849,41574,41415,40474,40489,42666,40554
Alaska,73181,76440,73355,71583,72237,67712,67825,64576,66953,68460,64333

### 1.5 Life expectancy

In [42]:
life = pd.read_csv(folder_path + separator + file_list[5], delimiter = ';')

In [43]:
index_state(life)

In [44]:
life.drop(index = 'United_States', inplace = True)

In [45]:
numerize(life)

In [46]:
life.dtypes

LifeExp2018    float64
LifeExp2010    float64
MaleLifeExp    float64
FemLifeExp     float64
dtype: object

In [47]:
life.head(2)

         LifeExp2018  LifeExp2010  MaleLifeExp  FemLifeExp
State
Alabama        75.40        75.40        72.60       78.10
Alaska         78.80        78.00        76.70       81.20

### 1.6 Religion

In [48]:
region = pd.read_csv(folder_path + separator + file_list[6], delimiter = '\t')

In [49]:
region.columns = ['State','Abb','Region','Division']

In [50]:
region.Division.value_counts()

Mountain              8
South Atlantic        7
West North Central    7
New England           6
Pacific               5
East North Central    5
East South Central    4
West South Central    3
Middle Atlantic       3
west south central    1
south atlantic        1
Name: Division, dtype: int64

In [51]:
region.Division = region.Division.str.title()
region.Division.value_counts()

South Atlantic        8
Mountain              8
West North Central    7
New England           6
Pacific               5
East North Central    5
East South Central    4
West South Central    4
Middle Atlantic       3
Name: Division, dtype: int64

In [52]:
index_state(region)

In [53]:
region.head(2)

        Abb Region            Division
State
Alabama  AL  South  East South Central
Alaska   AK   West             Pacific

## 2. Data completness analysis

In [54]:
dataframes = [area, crime, edu, income, life, region]
datanames = ['Area', 'Crime', 'Edu', 'Income', 'Life_Exp', 'Region']

In [55]:
for i, df in enumerate(dataframes):
    dataframes[i].name = datanames[i]

In [56]:
for df in dataframes:
    print(df.name)
    print(df.isnull().sum())
    print(df.describe())    
    print('-------------------')

Area
TotalRank    0
TotalSqMi    0
TotalKmQ     0
LandRank     0
LandSqMi     0
LandKmQ      0
LandPer      0
WaterRank    0
WaterSqMi    0
WaterKmQ     0
WaterPer     0
dtype: int64
       TotalRank  TotalSqMi   TotalKmQ  LandRank  LandSqMi    LandKmQ  \
count      50.00      50.00      50.00     50.00     50.00      50.00
mean       25.50   75933.48  196666.84     25.50  70636.89  182948.72
std        14.58   97327.42  252076.91     14.58  85815.68  222261.52
min         1.00    1544.89    4001.00      1.00   1033.81    2678.00
25%        13.25   37416.61   96908.50     13.25  36741.17   95159.00
50%        25.50   57093.18  147870.50     25.50  53891.28  139577.50
75%        37.75   84564.90  219022.25     37.75  81225.73  210373.50
max        50.00  665384.04 1723337.00     50.00 570640.95 1477953.00

       LandPer  WaterRank  WaterSqMi  WaterKmQ  WaterPer
count    50.00      50.00      50.00     50.00     50.00
mean     91.67      25.50    5296.59  13718.16      8.33
std      10.24      14.58   14256.07  36923.11     10.24
min      58.46       1.00     191.83    497.00      0.24
25%      87.22      13.25     705.76   1828.00      1.65
50%      96.69      25.50    1501.21   3888.00      3.31
75%      98.36      37.75    4373.04  11325.75     12.78
max      99.76      50.00   94743.10 245384.00     41.54
-------------------
Crime
Population_total                0
Murders_and_Manslaughter        0
Murders                         2
Gun_Murders                     2
Gun_Ownership                   0
Murder_and_manslaughter_rate    0
Murder_rate                     2
Gun_Murder_rate                 2
dtype: int64
       Population_total  Murders_and_Manslaughter  Murders  Gun_Murders  \
count             51.00                     51.00    49.00        49.00
mean         6292492.51                    307.71   273.69       195.59
std          7181993.08                    353.33   335.08       239.27
min           586107.00                     10.00    10.00         4.00
25%          1746940.50                     62.50    57.00        34.00
50%          4424611.00                    181.00   164.00       115.00
75%          6988927.50                    443.50   394.00       297.00
max         38993940.00                   1861.00  1861.00      1275.00

       Gun_Ownership  Murder_and_manslaughter_rate  Murder_rate  \
count          51.00                         51.00        49.00
mean           32.95                          4.95         4.57
std            13.44                          3.50         3.48
min             5.20                          1.10         1.10
25%            26.05                          2.85         2.70
50%            32.20                          4.50         4.10
75%            42.60                          6.00         5.50
max            61.70                         24.20        24.20

       Gun_Murder_rate
count            49.00
mean              3.21
std               2.73
min               0.30
25%               1.60
50%               2.90
75%               3.90
max              18.00
-------------------
Edu
high_school         0
high_school_rank    0
ba_degree           0
ba_rank             0
adv_degree          0
adv_rank            0
dtype: int64
       high_school  high_school_rank  ba_degree  ba_rank  adv_degree  adv_rank
count        51.00             51.00      51.00    51.00       51.00     51.00
mean         88.54             26.00      30.63    26.00       11.68     25.98
std           3.46             14.87       6.23    14.87        4.03     14.87
min          76.70              1.00      19.90     1.00        7.80      1.00
25%          86.20             13.50      26.95    13.50        9.45     13.50
50%          89.30             26.00      29.90    26.00       10.70     26.00
75%          91.25             38.50      33.20    38.50       12.80     38.50
max          93.00             51.00      56.60    51.00       32.80     51.00
-------------------
Income
Income2017    0
Income2016    0
Income2015    0
Income2014    0
Income2013    0
Income2012    0
Income2011    0
Income2010    0
Income2009    0
Income2008    0
Income2007    0
dtype: int64
       Income2017  Income2016  Income2015  Income2014  Income2013  Income2012  \
count       51.00       51.00       51.00       51.00       51.00       51.00
mean     60241.94    58173.76    56413.69    54544.98    53149.84    51865.88
std      10251.15     9777.93     9505.14     9175.89     8870.50     8644.76
min      43469.00    41754.00    40593.00    39680.00    37963.00    37095.00
25%      53069.00    51303.00    49467.50    47695.00    46857.00    45235.50
50%      58570.00    56565.00    54736.00    52622.00    51440.00    50723.00
75%      68373.00    65642.00    63200.00    61112.50    58787.50    56907.00
max      82336.00    78945.00    75847.00    73971.00    72483.00    71836.00

       Income2011  Income2010  Income2009  Income2008  Income2007
count       51.00       51.00       51.00       51.00       51.00
mean     51033.22    50083.39    50389.18    52123.22    50236.51
std       8464.67     8222.19     8523.82     8518.20     8078.41
min      36919.00    36851.00    36538.00    37790.00    36338.00
25%      44260.50    43895.50    44736.00    46290.50    44100.50
50%      49392.00    48615.00    48408.00    50177.00    48576.00
75%      56578.50    55101.50    55523.00    57140.50    55085.50
max      70004.00    68854.00    69272.00    70545.00    68080.00
-------------------
Life_Exp
LifeExp2018    0
LifeExp2010    0
MaleLifeExp    0
FemLifeExp     0
dtype: int64
       LifeExp2018  LifeExp2010  MaleLifeExp  FemLifeExp
count        56.00        56.00        56.00       56.00
mean         78.71        78.41        76.30       81.12
std           1.89         1.69         1.95        1.89
min          74.80        74.00        71.90       77.00
25%          77.67        77.47        75.20       79.95
50%          79.10        78.65        76.75       81.35
75%          79.90        79.62        77.60       82.32
max          82.30        81.40        79.40       85.60
-------------------
Region
Abb         0
Region      0
Division    0
dtype: int64
       Abb Region        Division
count   50     50              50
unique  50      4               9
top     RI  South  South Atlantic
freq     1     16               8
-------------------

### 3. Save the data

In [57]:
output_folder_path = r'C:\Users\igord\Projects\Manning\Life_exp\csv\output'

In [60]:
for i, df in enumerate(dataframes):
    df.to_csv(output_folder_path + separator + datanames[i] + '.csv')